EmptyProject/src/AccumulationRegisters/ТоварыНаСкладе/ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EmptyProject/src/AccumulationRegisters/ТоварыНаСкладе/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// 	Функция возвращает остаток по переданной номенклатуре в виде соответствия, 
// 	где ключ - склад, а значение - количество остатка на данном складе

// Параметры:
// 	Номенклатура - СправочникСсылка.Номенклатура - номенклатура, остаток которой необходимо получить
//
// Возвращаемое значение:
// 	Соответствие - Остаток по переданной номенклатуре в виде соответствия, 
// 	где ключ - склад, а значение - количество остатка на данном складе

Функция ОстатокНоменклатуры(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыНаСкладе.Склад КАК Склад,
	|	ТоварыНаСкладе.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладе.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладе.Остатки(, Номенклатура = &Номенклатура, ) КАК ТоварыНаСкладе";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Остаток = Новый Соответствие;
	Для Каждого Строка Из Результат Цикл
		Остаток.Вставить(Строка.Склад, Строка.КоличествоОстаток);
	КонецЦикла;
	Возврат Остаток;

КонецФункции


#КонецОбласти

#КонецЕсли
